string text1 = "Комсомольцы трудились день и ночь, не покладая рук, не вставая с постели. \nЛетом, мы с пацанами ходили в поход с ночевкой, и с собой взяли только необходимое. Картошку, палатку и Марию Ивановну. \nУмер М. Ю. Лермонтов на Кавказе, но любил он его не поэтому! \nПлюшкин навалил у себя в углу целую кучу и каждый день туда подкладывал. \nЛенский вышел на дуэль в панталонах. Они разошлись и раздался выстрел. \nДантес не стоил выеденного яйца Пушкина \nВо двор въехали две лошади. Это были сыновья Тараса Бульбы. \nОнегину нравился Байрон, поэтому он и повесил его над кроватью. \nГерасим поставил на пол блюдечко, и стал тыкать в него мордочкой. \nУ Онегина было тяжело внутри, и он пришел к Татьяне облегчиться. \nАндрей Болконский часто ездил поглядеть тот дуб, на который он был похож как две капли воды. \nЛермонтов родился у бабушки в деревне, когда его родители жили в Петербурге. \nГерасим налил Муме щей. \nБедная Лиза рвала цветы и этим кормила свою мать. \nХлестаков сел в бричку и крикнул: \"Гони, голубчик, в аэропорт! \" \nОтец Чацкого умер в детстве. \nВдруг Герман услыхал скрип рессор. Это была старая княгиня. \nУ Ростовых было три дочери: Наташа, Соня и Николай. \nИз всех женских прелестей у Марии Болконской были только глаза. \nТарас сел на коня. Конь согнулся, а потом засмеялся. \nДуша Татьяны полна любви и ждёт не дождётся, как бы обдать ею кого-нибудь. \nШел полк французов и кутузов. \nОнегин был богатый человек: по утрам он сидел в уборной, а потом ехал в цирк. \nПетр Первый соскочил с пьедестала и побежал за Евгением, громко цокая копытами. \nНос Гоголя наполнен глубочайшим содержанием. \nГлухонемой Герасим не любил сплетен и говорил только правду. \nТургенева не удовлетворяют ни отцы, ни дети. \nТакие девушки, как Ольга, уже давно надоели Онегину, да и Пушкину тоже. \nС Михаилом Юрьевичем Лермонтовым я познакомилась в детском саду. \nГерасим ел за четверых, а работал один. \nБазаров любил разных насекомых и делал им прививки. \nПугачев пожаловал шубу и лошадь со своего плеча. \nУ Чичикова много положительных черт: он всегда выбрит и пахнет. \nБазаров умер молодым человеком и сбыча его мечт не произошла. \nСыновья приехали к Тарасу и стали с ним знакомиться. \nЧичиков ехал в карете с поднятым задом. \nПо дороге в Богучарово Андрей Болконский, как старый дуб, расцвел и зазеленел. \nФамусов осуждает свою дочь за то, что Софья с самого утра и уже с мужчиной. \nНаташа была истинно русской натурой, очень любила природу и часто ходила на двор. \nГерасим бросил Татьяну и связался с Муму. \nГрушницкий тщательно целил в лоб, пуля оцарапала колено. \nПоэты XIX века были легкоранимыми людьми: их часто убивали на дуэлях. \nЗдесь он впервые узнал разговорную русскую речь от няни Арины Родионовны. \nПервые успехи Пьера Безухова в любви были плохие - он сразу женился. \nВ результате из Тихона вырос не мужчина, а самый настоящий овца. \nЯзык у Базарова был тупой, но потом заострился в спорах. \nМне нравится то, что с таким талантом Пушкин не побоялся стать народным поэтом. \nТроекуров был хотя не глуп, но немного с приветом. \nТак как Печорин - человек лишний, то и писать о нем - лишняя трата времени.";
string text2 = "Комсомольцы трудились день и ночь, не покладая рук, не вставая с постели. \r\nЛетом, мы с пацанами ходили в поход с ночевкой, и с собой взяли только необходимое. Картошку, палатку и Марию Ивановну. \r\nУмер М. Ю. Лермонтов на Кавказе, но любил он его не поэтому! \r\nПлюшкин навалил у себя в углу целую кучу и каждый день туда подкладывал. \r\nЛенский вышел на дуэль в панталонах. Они разошлись и раздался выстрел. \r\nДантес не стоил выеденного яйца Пушкина \r\nВо двор въехали две лошади. Это были сыновья Тараса Бульбы. \r\nОнегину нравился Байрон, поэтому он и повесил его над кроватью. \r\nГерасим поставил на пол блюдечко, и стал тыкать в него мордочкой. \r\nУ Онегина было тяжело внутри, и он пришел к Татьяне облегчиться. \r\nАндрей Болконский часто ездил поглядеть тот дуб, на который он был похож как две капли воды. \r\nЛермонтов родился у бабушки в деревне, когда его родители жили в Петербурге. \r\nГерасим налил Муме щей. \r\nБедная Лиза рвала цветы и этим кормила свою мать. \r\nХлестаков сел в бричку и крикнул: \"Гони, голубчик, в аэропорт! \" \r\nОтец Чацкого умер в детстве. \r\nВдруг Герман услыхал скрип рессор. Это была старая княгиня. \r\nУ Ростовых было три дочери: Наташа, Соня и Николай. \r\nИз всех женских прелестей у Марии Болконской были только глаза. \r\nТарас сел на коня. Конь согнулся, а потом засмеялся. \r\nДуша Татьяны полна любви и ждёт не дождётся, как бы обдать ею кого-нибудь. \r\nШел полк французов и кутузов. \r\nОнегин был богатый человек: по утрам он сидел в уборной, а потом ехал в цирк. \r\nПетр Первый соскочил с пьедестала и побежал за Евгением, громко цокая копытами. \r\nНос Гоголя наполнен глубочайшим содержанием. \r\nГлухонемой Герасим не любил сплетен и говорил только правду. \r\nТургенева не удовлетворяют ни отцы, ни дети. \r\nТакие девушки, как Ольга, уже давно надоели Онегину, да и Пушкину тоже. \r\nС Михаилом Юрьевичем Лермонтовым я познакомилась в детском саду. \r\nГерасим ел за четверых, а работал один. \r\nБазаров любил разных насекомых и делал им прививки. \r\nПугачев пожаловал шубу и лошадь со своего плеча. \r\nУ Чичикова много положительных черт: он всегда выбрит и пахнет. \r\nБазаров умер молодым человеком и сбыча его мечт не произошла. \r\nСыновья приехали к Тарасу и стали с ним знакомиться. \r\nЧичиков ехал в карете с поднятым задом. \r\nПо дороге в Богучарово Андрей Болконский, как старый дуб, расцвел и зазеленел. \r\nФамусов осуждает свою дочь за то, что Софья с самого утра и уже с мужчиной. \r\nНаташа была истинно русской натурой, очень любила природу и часто ходила на двор. \r\nГерасим бросил Татьяну и связался с Муму. \r\nГрушницкий тщательно целил в лоб, пуля оцарапала колено. \r\nПоэты XIX века были легкоранимыми людьми: их часто убивали на дуэлях. \r\nЗдесь он впервые узнал разговорную русскую речь от няни Арины Родионовны. \r\nПервые успехи Пьера Безухова в любви были плохие - он сразу женился. \r\nВ результате из Тихона вырос не мужчина, а самый настоящий овца. \r\nЯзык у Базарова был тупой, но потом заострился в спорах. \r\nМне нравится то, что с таким талантом Пушкин не побоялся стать народным поэтом. \r\nТроекуров был хотя не глуп, но немного с приветом. \r\nТак как Печорин - человек лишний, то и писать о нем - лишняя трата времени.";
int choice;

do
{
    //Console.WriteLine($"Текст для анализа:\n{text1}");
    Console.WriteLine("1. Провести анализ\n2. Ввести новый текст\n3. Вывести статистику по прошлому тексту\n0. Выход");
    choice = Convert.ToInt32(Console.ReadLine());
} while (choice == 0); {

    switch (choice) {
        case 1:
            Analysis(text1);
            break;
        case 2:
            break;
        case 3:
            break;
        case 0:
            break;
    }
    //Console.WriteLine($"Текст для анализа:\n{text1}");
    Console.WriteLine("1. Провести анализ\n2. Ввести новый текст\n3. Вывести статистику по прошлому тексту\n0. Выход");
    choice = Convert.ToInt32(Console.ReadLine());
}

void Analysis(string text) {

    Dictionary<char, int> frequency = new Dictionary<char, int>();

    int countOfWords = 0;
    int countOfSentences = 0;
    int countOfVowels = 0;
    int countOfСonsonants = 0;

    string vowelPatern = "аеёиоуыэюя";
    string charsPatern = ".!?";

    string[] textlst = text.Split(separator: " ");
    string shortestWord = textlst[0];
    string longestWord = textlst[0];

    foreach (string word in textlst) {
        countOfWords++; // подсчет слов

        if (word == "-") {
            countOfWords--;
            continue;
        }
        if (shortestWord.Length > word.Length) // выявление кратчайшего слова
        {
            shortestWord = word;
        }

        if (longestWord.Length < word.Length) // выявление длинейшего слова
        {
            longestWord = word;
        }

        string lowerWord = word.ToLower();

        for (int i = 0; i < word.Length; i++) {

            if (vowelPatern.Contains(lowerWord[i]))
            {
                countOfVowels++; // подсчет глассных
            }
            else if (charsPatern.Contains(lowerWord[i]))
            {
                countOfSentences++; // подсчет предложений
            }
            else
            {
                countOfСonsonants++; // подсчет соглассных
            }

            if (frequency.ContainsKey(lowerWord[i]))
            {
                frequency[lowerWord[i]]++;
            }
            else
            {
                frequency.Add(lowerWord[i], 1);
            }
        }
    }
    Console.WriteLine($"---------------------------------\nСтатистика:\nКоличество предложений: {countOfSentences}\nКоличество слов: {countOfWords}\nКоличество гласных: {countOfVowels}\nКоличество согласных: {countOfСonsonants}\nСамое длинное слово: {longestWord}\nСамое короткое слово: {shortestWord}\n---------------------------------");

}

class Statistic {
    
}